app/controllers/bills/votes_controller.rb

  def create
    if @vote.save
---
INSERT INTO `votes` (`created_at`, `updated_at`, `user_id`, `yes`, `bill_id`) VALUES('2010-01-26 01:39:36', '2010-01-26 01:39:36', 3, 1, 1)