app/controllers/bills_controller.rb

SELECT * FROM `bills` LIMIT 1
---
  def index
    @bills = Bill.all

INSERT INTO `bills` (`name`, `created_at`, `body`, `updated_at`) VALUES(NULL, '2010-01-10 03:07:44', NULL, '2010-01-10 03:07:44')
---
  def create
    respond_to do |format|
      if @bill.save

UPDATE `bills` SET `updated_at` = '2010-01-15 04:15:52', `name` = 'Truncated' WHERE `id` = 6
---
  def update
    respond_to do |format|
      if @bill.update_attributes(params[:bill])

DELETE FROM `bills` WHERE `id` = 1
---
  def destroy
    @bill.destroy