app/controllers/users_controller.rb

  def create
    if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-01-24 23:53:14', 'fbba8da1c2f5418b0c1d3bbf1deb01d3d828f582c17be88b5bb46b9a74119a9f12277cd55bd3e64c629e7aba21efcb51c459b42cf0528abc69d772311fedb345', '2010-01-24 23:53:14', 'aosalias', 'AzoJs_l4qRMan-JoM-aw', '29836c07c0723ef7a6275337a06dcbde94a591d05c3661aedfd10776642420075b0d1dbca5211dc332202a4d3be96438036ad01f640e04c95e1137d7ab768ec9', 'adam@email.com')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-01-26 01:33:40', `crypted_password` = 'b0c3380b5c136a97a0fc41883b4f33fc6b7570aec5e8f0d3473e9c26a8f85c7b6209e4b38bed5649d7f13cf5fd37b25c44314e0e7ab228b4a46497a42edd28ac', `password_salt` = 'yGjdGF2en2mLtb5b_-Fa', `persistence_token` = '7f331398dc02244a843c2061024f4c037b94ee889780ddceaf5c5d028fa0ba18be7f453b2a4a4ff61c9ef55b880453d40f3616853cb9ebe8c8fad1ed359e2fc8' WHERE `id` = 1